<h2><center>Data Modeling</center></h2>

In [1]:
import os
import pandas as pd

<h3>Look at each csv file</h3>

In [2]:
pd.read_csv("./data/departments.csv").head(2)

  dept_no  dept_name
0    d001  Marketing
1    d002    Finance

In [3]:
pd.read_csv("./data/dept_emp.csv").head(2)

   emp_no dept_no
0   10001    d005
1   10002    d007

In [4]:
pd.read_csv("./data/dept_manager.csv").head(2)

  dept_no  emp_no
0    d001  110022
1    d001  110039

In [5]:
pd.read_csv("./data/employees.csv").head(2)

   emp_no emp_title_id  birth_date first_name  last_name sex  hire_date
0  473302        s0001   7/25/1953   Hideyuki   Zallocco   M  4/28/1990
1  475053        e0002  11/18/1954      Byong  Delgrande   F   9/7/1991

In [6]:
pd.read_csv("./data/salaries.csv").head(2)

   emp_no  salary
0   10001   60117
1   10002   65828

In [7]:
pd.read_csv("./data/titles.csv").head(2)

  title_id         title
0    s0001         Staff
1    s0002  Senior Staff

<h3>Read all of the columns from csv files</h3>

In [8]:
for file in os.listdir("./data"):
    print(file)
    dataFrame = pd.read_csv(f"./data/{file}")
    for column in dataFrame.columns:
        print(f" - {column}")

departments.csv
 - dept_no
 - dept_name
dept_emp.csv
 - emp_no
 - dept_no
dept_manager.csv
 - dept_no
 - emp_no
employees.csv
 - emp_no
 - emp_title_id
 - birth_date
 - first_name
 - last_name
 - sex
 - hire_date
salaries.csv
 - emp_no
 - salary
titles.csv
 - title_id
 - title

<h3>Create an entity relationship diagram (./EmployeeSQL/ER.png)</h3>

<img src="EmployeeSQL/ER.png" />

<h3>Create or export sql schema from the ER diagram (./EmployeeSQL/schema.sql)</h3>

<pre>
CREATE DATABASE employees
    WITH 
    OWNER = postgres
    ENCODING = 'UTF8'
    TABLESPACE = pg_default
    CONNECTION LIMIT = -1;

CREATE TABLE "departments" (
    "dept_no" varchar(4)   NOT NULL,
    "dept_name" varchar(128)   NOT NULL,
    CONSTRAINT "pk_departments" PRIMARY KEY (
        "dept_no"
     )
);

CREATE TABLE "dept_emp" (
    "emp_no" integer   NOT NULL,
    "dept_no" varchar(4)   NOT NULL,
    CONSTRAINT "pk_dept_emp" PRIMARY KEY (
        "emp_no","dept_no"
     )
);

CREATE TABLE "dept_manager" (
    "dept_no" varchar(4)   NOT NULL,
    "emp_no" integer   NOT NULL,
    CONSTRAINT "pk_dept_manager" PRIMARY KEY (
        "dept_no","emp_no"
     )
);

CREATE TABLE "employees" (
    "emp_no" integer   NOT NULL,
    "emp_title_id" varchar(128)   NOT NULL,
    "birth_date" date   NOT NULL,
    "first_name" varchar(128)   NOT NULL,
    "last_name" varchar(128)   NOT NULL,
    "sex" varchar(1)   NOT NULL,
    "hire_date" date   NOT NULL,
    CONSTRAINT "pk_employees" PRIMARY KEY (
        "emp_no"
     )
);

CREATE TABLE "salaries" (
    "emp_no" integer   NOT NULL,
    "salary" integer   NOT NULL,
    CONSTRAINT "pk_salaries" PRIMARY KEY (
        "emp_no"
     )
);

CREATE TABLE "titles" (
    "title_id" varchar(5)   NOT NULL,
    "title" varchar(128)   NOT NULL,
    CONSTRAINT "pk_titles" PRIMARY KEY (
        "title_id"
     )
);

ALTER TABLE "dept_emp" ADD CONSTRAINT "fk_dept_emp_emp_no" FOREIGN KEY("emp_no")
REFERENCES "employees" ("emp_no");

ALTER TABLE "dept_emp" ADD CONSTRAINT "fk_dept_emp_dept_no" FOREIGN KEY("dept_no")
REFERENCES "departments" ("dept_no");

ALTER TABLE "dept_manager" ADD CONSTRAINT "fk_dept_manager_dept_no" FOREIGN KEY("dept_no")
REFERENCES "departments" ("dept_no");

ALTER TABLE "dept_manager" ADD CONSTRAINT "fk_dept_manager_emp_no" FOREIGN KEY("emp_no")
REFERENCES "employees" ("emp_no");

ALTER TABLE "employees" ADD CONSTRAINT "fk_employees_emp_title_id" FOREIGN KEY("emp_title_id")
REFERENCES "titles" ("title_id");

ALTER TABLE "salaries" ADD CONSTRAINT "fk_salaries_emp_no" FOREIGN KEY("emp_no")
REFERENCES "employees" ("emp_no");
</pre>

<h3><center>Finally I execute all of the sql statements into the database</center></h3>